code/SOAP/soap_api.xml

<?xml version="1.0" encoding="UTF-8"?>
<!-- a standard SOAP request -->
<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope/" xmlns:sch="http://www.soapexample.com/xml/users">
    <soapenv:Header/>
    <soapenv:Body>
        <sch:GetStockPrice>
            <sch:StockName>CSCO</sch:StockName>
        </sch:GetStockPrice>
    </soapenv:Body>
</soapenv:Envelope>
